Reports/ЗагрузкаРесурсовАвтосервиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>ЗагрузкаРесурсовАвтосервиса</Name>
		</Properties>
	</Report>
</MetaDataObject>

Enums/НазначениеПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НазначениеПравИНастроек</Name>
			<Comment>Определяют уровень применимости права / настройки</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
					<Comment>Значение права определяется для компании в целом (всей информационной базы)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
					<Comment>Значение права определяется для каждой организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Значение права определяется для каждого подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Значение права определяется для каждого пользователя</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Comment>Объект по которому производится отображение настраиваемых вариантов отчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяНастройка</Name>
					<Comment>Пользовательская настройка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузкиПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ЗагрузкаРесурсовАвтосервиса/Ext/ManagerModule.bsl
Процедура СоздатьВариантыОтчета(КлючОтчета, МассивИсключений = Неопределено, КлючВарианта = Неопределено) Экспорт
	
	Если МассивИсключений = Неопределено Тогда
		МассивИсключений = Новый Массив;
	КонецЕсли;
	
	Имя           = СтрЗаменить(КлючОтчета, "Отчет.", "");
	Представление = Метаданные.Отчеты[Имя].Синоним;
	
	ПользовательСеанса = ПараметрыСеанса.Пользователь;
	
	ОтчетОбъект = Отчеты[Имя].Создать();
	СхемаКомпоновки = ОтчетОбъект.СхемаКомпоновкиДанных;
	
	Для Каждого ТекВариантНастроек Из СхемаКомпоновки.ВариантыНастроек Цикл
		
		Если НЕ МассивИсключений.Найти(ТекВариантНастроек.Имя) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если (НЕ КлючВарианта = Неопределено) И (НЕ ТекВариантНастроек.Имя = КлючВарианта) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураНастроек = Обработки.АРМЗаписьНаРемонт.ПолучитьСписокНастроекАРМ();
		Если ТекВариантНастроек.Имя = "ПоЦехам" Тогда
			СтруктураНастроек.РежимКалендаря = 1;	
		ИначеЕсли ТекВариантНастроек.Имя = "ПоИсполнителям" Тогда
			СтруктураНастроек.РежимКалендаря = 2;	
		КонецЕсли;
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
		КомпоновщикНастроек.ЗагрузитьНастройки(ТекВариантНастроек.Настройки);
		НастройкиАРМ = Новый ХранилищеЗначения(СтруктураНастроек);
		
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НастройкиАРМ", НастройкиАРМ);
		
		НовыйЭлемент = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		НовыйЭлемент.Наименование           = ТекВариантНастроек.Представление;
		НовыйЭлемент.ИмяОтчета              = Имя;
		НовыйЭлемент.КлючОтчета             = КлючОтчета;
		НовыйЭлемент.ПредставлениеОтчета    = Представление;
		НовыйЭлемент.КлючВарианта           = ТекВариантНастроек.Имя;
		НовыйЭлемент.Автор                  = ПользовательСеанса;
		НовыйЭлемент.ЭтоПредопределенный    = Истина;
		НовыйЭлемент.НазначениеДоступа      = Перечисления.НазначениеПравИНастроек.Компания;
		НовыйЭлемент.Настройки              = Новый ХранилищеЗначения(КомпоновщикНастроек.Настройки);
		НовыйЭлемент.ВариантЗагрузкиПериода = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантПериода(КлючОтчета, ТекВариантНастроек.Имя);
		Попытка
			НовыйЭлемент.Записать();
			Сообщить("Создан вариант отчета <"+НовыйЭлемент.ПредставлениеОтчета+"-"+НовыйЭлемент.Наименование+">");
		Исключение
		КонецПопытки;
		
		Если НЕ КлючВарианта = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьПризнакПредопределенногоУВариантовОтчета(КлючОтчета, ТаблицаВариантов) Экспорт
	
	Имя = СтрЗаменить(КлючОтчета, "Отчет.", "");
	
	ОтчетОбъект = Отчеты[Имя].Создать();
	СхемаКомпоновки = ОтчетОбъект.СхемаКомпоновкиДанных;
	
	Для Каждого ТекВариант Из ТаблицаВариантов Цикл
		Если СхемаКомпоновки.ВариантыНастроек.Найти(ТекВариант.КлючВарианта) = Неопределено Тогда
			ВариантОбъект = ТекВариант.Ссылка.ПолучитьОбъект();
			ВариантОбъект.ЭтоПредопределенный = Ложь;
			Попытка
				ВариантОбъект.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
